package com.smartlab.drivetrain.data;

import com.smartlab.drivetrain.model.LatlngList;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by smartlab on 15/9/27.
 */
public class DrivingData{

    public static List<LatlngList> getDataInfo(){
        String schoolName [] = {"荆州市兴成驾驶员培训学校有限公司","荆州市机动车驾驶员培训学校有限公司","荆州市先行汽车技术综合培训学校有限公司","荆州市东方汽车驾驶员培训学校有限公司"
        ,"荆州市顺鑫驾驶员培训有限公司","荆州市和兴驾驶员培训有限公司","荆州市永安驾驶员培训有限公司","荆州市星光驾驶员培训有限责任公司","荆州市创业机动车驾驶员培训有限公司","荆州市玉桥机动车驾驶员培训有限公司"
        ,"荆州市众和机动车驾驶员培训学校有限公司","荆州市楚天驾驶员培训有限公司","荆州市金鹏机动车驾驶员培训有限公司","湖北吉祥汽车驾驶培训学校有限公司","荆州市古城驾驶员培训学校有限公司"
        , "荆州市昌发驾驶员培训有限公司","荆州市荣泰机动车驾驶员培训有限公司","荆州市沙石驾驶员培训有限公司","荆州市安家岔机动车驾驶员培训中心","松滋市松立汽车驾驶员培训有限公司","松滋市金松机动车驾驶员培训学校"
        ,"松滋市新公汽车驾驶员培训有限公司"
        };
        String schoolAddress [] = {"荆州市沙市区江津西路269号","荆州市小北门转盘以东楚源大道104号","沙市区武德路53号","荆州区西林湾二巷34号","荆州区凤凰路53号","沙市区江津东路30号","荆州城南开发区健康路8号",
        "荆州区演武路89号","荆州开发区东方大道以南中辉门窗以东","荆州开发区燎原北路东","沙市区立新乡张沟村（原飞机场内）","荆州区荆州大道224号","荆州区纪南镇高台村五组","荆州区御河路368号","荆州城南开发区新风一路3号",
        "荆州区弥市镇龙华五组6号","荆州区弥市镇虎渡一路","沙市区十号路同心村9组","荆州区安家岔集镇","松滋市八宝镇白水淌村","松滋市新江口镇乐乡大道253号","松滋市新江口镇创业路6号"
        };
        String number [] = {"13797287614","07164178008","13872378908","13508627518","13986709328","18908618918","13707212068","18627266146","13797489708","18972369988","13972122847","15927911999","13217268999",
        "13907218668","13986673050","13972398889","13886580789","13308611428","15826616528","13872445511","13317211980","18908617730"};

        List<LatlngList> schoolInfos = new ArrayList<>();
        float j = 0.5f;
        for (int i = 0; i < schoolName.length;i++) {
            LatlngList info0 = new LatlngList();
            info0.setName(schoolName[i]);
            info0.setAddress("地址："+schoolAddress[i]);
//            info0.setPhone("招生电话："+number[i]);
            j++;
            if (j > 5){
                j = 0.5f;
            }
            schoolInfos.add(info0);
        }
        return schoolInfos;
    }

}
